{
    "books": [
        {
            "id": 1,
            "title": "JoJo's Bizarre Adventure",
            "img": "https://i.pinimg.com/originals/4a/de/69/4ade697d6c1476320f645a0ba38f9ecd.jpg",
            "author": "Hirohiko Araki",
            "publisher": "Viz Media",
            "genres": [
                "Adventure",
                "Fantasy",
                "Supernatural"
            ],
            "synopsis": "The universe of JoJo's Bizarre Adventure is a reflection of the real world with the added existence of supernatural forces and beings. In this setting, some people are capable of transforming their inner spiritual power into a Stand (スタンド, Sutando); another significant form of energy is Hamon (波紋, \"Ripple\"), a martial arts technique that allows its user to focus bodily energy into sunlight via controlled breathing. The narrative of JoJo's Bizarre Adventure is split into parts with independent stories and different characters. Each of the series' protagonists is a member of the Joestar family, whose mainline descendants possess a star-shaped birthmark above their left shoulder blade and a name that can be abbreviated to the titular \"JoJo\".[a] The first six parts take place within a single continuity whose generational conflict stems from the rivalry between Jonathan Joestar and Dio Brando, while the latter two parts take place in an alternate universe where the Joestar family tree is heavily altered.",
            "copise": 1
        },
        {
            "id": 2,
            "title": "Chainsaw man",
            "img": "https://kbimages1-a.akamaihd.net/9b90e481-4b79-47e1-a919-3d0a46752177/1200/1200/False/chainsaw-man-vol-1.jpg",
            "author": "Tatsuki Fujimoto",
            "publisher": "Shueisha",
            "genres": [
                "Action Fiction",
                "Comedy horror",
                "Dark fantasy"
            ],
            "synopsis": "In the world of Chainsaw Man, Devils are born from human fears. Devils are usually dangerous and malevolent, their power is proportional to how strongly their correspondent fear is incited in the collective human consciousness. However, humans can form contracts with them to use their powers. Individuals who specialize in hunting and employing Devils are called Devil hunters. Devils originate from Hell, and exist in an endless life cycle between Earth and Hell: they are reborn on Earth when killed in Hell, and vice-versa. Dwelling in Hell are extremely powerful Devils called Primal Fears, which have never been killed. Transit between the two planes appears to be overseen by the Hell Devil.\n\nA Devil may, in certain conditions, inhabit the body of a dead human, gaining some of their memories and personality; such a creature is called a Fiend. Devils who naturally have a human-like appearance are said to be benevolent towards humans.\n\nThe events of the story take place in 1997, in an alternate timeline where the Soviet Union still exists, and many historical events such as the Holocaust appear to have never occurred.",
            "copise": 2
        },
        {
            "id": 3,
            "title": "One Piece",
            "img": "https://upload.wikimedia.org/wikipedia/en/9/90/One_Piece%2C_Volume_61_Cover_%28Japanese%29.jpg",
            "author": "Eiichiro Oda",
            "publisher": "Viz Media",
            "genres": [
                "Adventure Fiction",
                "Fantasy"
            ],
            "synopsis": "The series focuses on Monkey D. Luffy, a young man who, inspired by his childhood idol and powerful pirate \"Red Haired\" Shanks, sets off on a journey from the East Blue Sea to find the titular treasure and proclaim himself the King of the Pirates. In an effort to organize his own crew, the Straw Hat Pirates,[Jp 1] Luffy rescues and befriends a swordsman named Roronoa Zoro, and they head off in search of the One Piece. They are joined in their journey by Nami, a navigator and thief; Usopp, a sniper and a pathological liar; and Vinsmoke Sanji, a perverted chef. They acquire a ship named the Going Merry[Jp 2] and engage in confrontations with notorious pirates of the East Blue. As Luffy and his crew set out on their adventures, others join the crew later in the series, including Tony Tony Chopper, a doctor and anthropomorphized reindeer; Nico Robin, an archaeologist and former assassin; Franky, a cyborg shipwright; Brook, a skeletal musician and swordsman; and Jimbei, a fish-man helmsman and former member of the Seven Warlords of the Sea. Once the Going Merry becomes damaged beyond repair, the Straw Hat Pirates acquire a new ship named the Thousand Sunny.[Jp 3] Together, they encounter other pirates, bounty hunters, criminal organizations, revolutionaries, secret agents and soldiers of the corrupt World Government, and various other friends and foes, as they sail the seas in pursuit of their dreams.",
            "copise": 3
        },
        {
            "id": 4,
            "title": "One Punch Man",
            "img": "https://upload.wikimedia.org/wikipedia/en/thumb/c/c3/OnePunchMan_manga_cover.png/220px-OnePunchMan_manga_cover.png",
            "author": "ONE",
            "publisher": "Viz Media",
            "genres": [
                "Action",
                "Gag comedy",
                "Superhero"
            ],
            "synopsis": "On a supercontinent Earth, powerful monsters and villains have been wreaking havoc in the cities. In response, the millionaire Agoni creates the Hero Association, which employs superheroes to fight evil. Saitama, an unassociated hero, hails from City Z and performs heroic deeds as a hobby. He has trained himself to the point of being able to defeat any enemy with a single punch, but his unmatched strength has left him with an overwhelming sense of boredom. Saitama eventually becomes a reluctant mentor to Genos, a cyborg seeking revenge against another cyborg who killed his family and destroyed his hometown. Saitama and Genos join the Hero Association, but due to scoring low on the written entry exam, Saitama is placed at a low-entry rank, and his feats remain unnoticed and unappreciated by the public.\n\nThe Hero Association calls all the top heroes to a meeting, informing them that the seer Shibabawa had a vision that the world is in danger before dying. Immediately after, an alien named Boros invades the planet. The heroes fight the invaders outside Boros's ship, while Saitama boards the ship and fights Boros, who notoriously survives more than one punch from Saitama before being defeated. Saitama meets other heroes, such as the martial artist Bang, the esper Blizzard, and King, a hero considered the strongest man on Earth. Monsters also begin to appear at a rising rate. Another growing threat is the rogue martial artist Garo, Bang's former apprentice and self-dubbed \"Hero Hunter\" Garo, who fights and defeats heroes to grow stronger and become a \"monster\".\n\nThe monster influx is revealed to be the doing of the Monster Association, an organization composed of monsters intent on destroying the Hero Association. They attack various cities, kidnap a Hero Association executive's child, and recruit fighters by offering them \"monster cells\", which cause humans to mutate into monsters with extraordinary abilities. Throughout all this, Garo bonds with a child who idolizes heroes, seeks out heroes to battle, and greatly improves his fighting abilities. The Monster Association attempts to recruit him, and kidnaps the child when Garo refuses. Garo enters the Monster Association headquarters in City Z to rescue the child, but is captured. The Hero Association also breaches the headquarters to rescue the executives' child and a chaotic battle ensues, in which City Z is destroyed. The majority of the Monster Association's leaders are slain, but many of the heroes, overconfident in their abilities, are defeated. Garo, having achieved tremendous power, defeats the remaining heroes, before Saitama in turn arrives and defeats him. Despite the objections of the other heroes, Saitama spares Garo's life and lets him flee.\n\nIn the aftermath of the battle, the Hero Association's poor performance leads to public opinion of them plummeting. Several heroes and officials decide to retire or defect to the Neo Heroes, a burgeoning rival group that appears to be more effective in handling the growing monster threats with its larger membership and the leadership of the hero Blue, who claims to be the son of the long-missing Blast.",
            "copise": 4
        },
        {
            "id": 5,
            "title": "Demon Slayer: Kimetsu no Yaiba",
            "img": "https://upload.wikimedia.org/wikipedia/en/0/09/Demon_Slayer_-_Kimetsu_no_Yaiba%2C_volume_1.jpg",
            "author": "Koyoharu Gotouge",
            "publisher": "Viz Media",
            "genres": [
                "Adventure fiction",
                "Dark fantasy",
                "Martial Arts"
            ],
            "synopsis": "The story takes place in Taishō-era Japan. It follows Tanjiro Kamado and his sister Nezuko Kamado as they seek a cure for Nezuko's demon curse. Tanjiro and Nezuko become entangled in the affairs of a secret society, known as the Demon Slayer Corps, that has been waging a secret war against demons for centuries. The demons are former humans who sold their humanity in exchange for power. They feed on humans and possess supernatural abilities such as super strength, magic, and regeneration. Demons can only be killed if they're decapitated with weapons crafted from an alloy known as Sun Steel, injected with poison extracted from wisteria flowers, or exposed to sunlight. The Demon Slayers, on the other hand, are entirely human; however, they employ special breathing techniques, known as \"Breathing Styles\", which grant them superhuman strength and increased resistance.",
            "copise": 5
        }
    ]
}